name: "concat_test"
input: "data"
input_dim: 1
input_dim: 5
input_dim: 20
input_dim: 20
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "data"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv1_a"
  type: "Convolution"
  bottom: "pool1"
  top: "conv1_a"
  convolution_param {
    num_output: 5
    kernel_size: 1
    stride: 1
    pad: 0
    bias_term: false
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "conv1_b"
  type: "Convolution"
  bottom: "pool1"
  top: "conv1_b"
  convolution_param {
    num_output: 15
    kernel_size: 1
    stride: 1
    pad: 0
    bias_term: false
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "concat1"
  type: "Concat"
  bottom: "conv1_a"
  bottom: "conv1_b"
  top: "concat1"
}
