name: "LeNet"
input: "data"
input_dim: 64
input_dim: 1
input_dim: 28
input_dim: 28
layers {
  name: "conv"
  type: CONVOLUTION
  bottom: "data"
  top: "conv"
  convolution_param {
    num_output: 20
    kernel_size: 5
    stride: 1
  }
}
